package com.github.akagawatsurunaki.novappro.service;

public class ApprovalService {

    /*
    TODO: 默认于老师为课程申请的审批人, 登录后, 网页上将会显示当前需要审批的审批.

    登陆后跳转到审批人的界面, 界面显示了loginUser的可以进行审批的审批列表.

    appl_list

    |---------------------------------------------|
    |审批流号  |标题|发起人|申请状态     |操作       |
    -----------------------------------------------
    | weuusa  你好  我      待我审批    |查看详情   |
    -----------------------------------------------
    |...                                          |

    点入其中一个审批列表

    其中有一分类为课程审批, 将会

    appl_detail

    申请详情

    flowNo applTitle
    applicant..
    applDate
    applCourses
    applStatus
    --------------------------------------------
    | 显示流水号:           |          申请标题  |
    --------------------------------------------
    |申请人信息
    --------------------------------------------
    |学号: 2398833
    |姓名: 你好
    --------------------------------------------
    |申请内容
    --------------------------------------------
    |申请时间: 2023年4月18日 12:12
    |申请内容: 申请人请求申请如下的课程
    | 课程名称(课程编号) | 授课教师
    |
    --------------------------------------------
    |审批状态: 待审批
    --------------------------------------------

    appro_comment

    审批意见
    [
                                                ]
    submit_appl_status

    [同意]              [拒绝]               [取消]

     */

}
